# Задание-1:
# Написать функцию, возвращающую ряд Фибоначчи с n-элементами до m-элемента.
# Первыми элементами ряда считать цифры 1 1

def  fibonacci ( n , m ):
    проходить

# Задача-2:
# Написать функцию, сортирующий принимаемый список по возрастанию.
# Для сортировки по любому алгоритм (например пузырьковый).
# Для решения данной задачи нельзя использовать встроенную функцию и метод sort ()


def  sort_to_max ( origin_list ):
    проходить

sort_to_max ([ 2 , 10 , - 12 , 2.5 , 20 , - 11 , 4 , 4 , 0 ])

# Задача-3:
# Писать фильтр для фильтрования.
# Разумеется, внутри нельзя использовать фильтр саму фильтра.


# Задача-4:
# Даны четыре точки А1 (х1, у1), А2 (х2, у2), А3 (х3, у3), А4 (х4, у4).
# Определить, будут ли они вершинами параллелограмма.
